# def message():
#     print('Привет')
#     print('Как дела?')
#
# # вызов функции:
# message()
#
# # Эта программа показывает пошаговые инструкции
# # для разборки бельевой сушилки фирмы Acme.
# # Главная функция выполняет основную логику программы.
# def main():
#     # Показать стартовое сообщение
#     startup_message()
#     input('Нажать "Enter", чтобы увидеть Шаг 1')
#     # Показать шаг 1
#     step1()
#     input('Нажать "Enter", чтобы увидеть шаг 2.')
#     # Показать шаг 2
#     step2()
#     input('Нажать "Enter", чтобы увидеть шаг 3.')
#     # Показать шаг 3
#     step3()
#     input('Нажать "Enter", чтобы увидеть шаг 4.')
#     # Показать шаг 4
#     step4()
#
# # Функция startup_message показывает первоначальное сообщение программы на экране.
# def startup_message():
#     print('Этa программа дает рекомендации')
#     print('пo разборке бельевой сушилки фирмы АСМЕ.')
#     print('Данный процесс состоит из 4 шагов.')
#     print()
#
# # Функция step1 показывает инструкции для шага 1.
# def step1():
#     print('Шаг 1: отключить сушилку и отодвинуть её от стены')
#     print()
# # Функция step2 показывает инструкции для шага 2
# def step2():
#     print('Шаг 2: удалить 6 винтов с задней стороны машинки')
#     print()
# # Функция step3 показывает инструкции для шага 3
# def step3():
#     print('Шаг 3: удалить заднюю панель сушилки')
#     print()
# # Функция step4 показывает инструкции для шага 4
# def step4():
#     print('Шаг 4: вынуть верхний блок сушилки.')
#     print()
#
# # Вызвать главную функцию, чтобы начать программу
# main()

# Эта программа конвертирует количество чашек в жидкие унции

# def main():
#     intro()
#     cups_needed = int(input('Введите количество чашек: '))
#     cupsToOunces(cups_needed)
#
# def intro():
#     print('Эта программа конвертирует количество чашек в '
#           'жидкие унции.\nДля справки приводим формулу: 1 чашка = 8 жидких унций')
#     print()
# def cupsToOunces(cups):
#     ounces = cups * 8
#     print('Это конвертируется в', ounces, 'унции(й)')
#
# main()

