# STRINGS

# # f-строка
# a = 100
# b = 300
# text = f'I have {a} rubles and {b} kop'
# print(text)
# ________________________________________________

# # Конкатенация (сложение)
# text = 'Hello' + ' ' + 'World'
# text2 = 'Hello' ' ' 'World'
# print(text)
# print(text2)
# # Конкатенация (умножение)
# text3 = 'a' * 10                # конкатенация, повторённая n раз
# text4 = 'Hello' * 5             # конкатенация, повторённая n раз
# print(text3)
# print(text4)
# # Узнать длину строки
# # для этого нужно строку передать в функцию 'len':
# print(len('Hello World!'))      # 12
# print(len(' '))                 # 1 - пробел = символ
# print(len(''))                  # 0 символов
#
# # Посмотреть все возможные методы для строки 'dir':
# print(dir('hello world'))

# text = 'hello world'
#
# print(text.upper())                        # Приведение строкового литерала к верхнему регистру:
# print(text.title())                        # Приведение первых букв литерала к верхнему регистру:
# print('         kjdwf%    '.strip())       # Удаление пробелов в строке метод 'strip'
# print('%%%       lhjkbfv %%%%%%'.strip('%'))    # Удаление символов в строке метод 'strip' (вначале и в конце текста)



